# # 算数运算符 : +  -  *  /  //  %  **
# print("10 + 4 = ", 10 + 4)  #加
# print("10 - 4 = ", 10 - 4)  #减
# print("10 * 4 = ", 10 * 4)  #乘
# print("10 / 4 = ", 10 / 4)  #除
# print("10 // 4 = ", 10 // 4)  #整除（结果为整数）
# print("10 % 4 = ", 10 % 4)  #取余/求模
# print("10 ** 4 = ", 10 ** 4)  #幂指数
#
# # 算数运算符的优先级 --> ** --> * --> / // % --> + -
# print("0.1 + 10 / 4 ** 2 = ", 0.1 + 10 / 4 ** 2)
#
#
# # 案例：要求输入两个数 x 和 y ， 计算 x + y 以及 x - y 的结果并输出
# # 0.09999999999999998 --> 精度缺失 ; 由于计算机底层是基于 二进制 进行数据的存储与处理，二进制无法准确的表示所有的小数，因此涉及到浮点数的运算，可能会损失精度
# x = float(input("请输入x的值: "))
# y = float(input("请输入y的值: "))
#
# print("x + y = ", x + y)
# print("x - y = ", x - y)
#
#
# 赋值运算符 ---> +=  -=  *=  /=  //=  %=  **=
num = 85

num += 10 # num = num + 10
print("num += 10 后, num = ",num)

num -= 10 # num = num - 10
print("num -= 10 后, num = ",num)

num *= 10 # num = num * 10
print("num *= 10 后, num = ",num)

num /= 10 # num = num / 10
print("num /= 10 后, num = ",num)

num //= 10
print("num //= 10 后, num = ",num)

num %= 3
print("num %= 10 后, num = ",num)

num **= 3
print("num **= 10 后, num = ",num)


# 比较运算符 ---> ==  !=  >  >=  <  <=
print("100 == 100 吗 : ", 100 == 100)
print("'100' == '100' 吗 : ", '100' == '100')
print("100 != 100 吗 : ", 100 != 100)

print("100 < 100 吗 : ", 100 < 100)
print("100 <= 100 吗 : ", 100 <= 100)

print("100 > 100 吗 : ", 100 > 100)
print("100 >= 100 吗 : ", 100 >= 100)


# # 逻辑运算符 ---> and(与)  or(或)  not(非)
# 案例：键盘输入一个数字，判断是否在 10-20之间
num = int(input("请输入一个整数: "))

print(f"{num}在10-20之间: ",10 <= num <= 20)

#案例: 键盘输入一个数字，判断是否不在10-20之间
num = int(input("请输入一个整数: "))

print(f"{num}不在10-20之间: ",num < 10 or num > 20)